= 情報I ガイダンス
: author
   加納　寛之
: date
   2026-04-15
: theme
   info-study

= 自己紹介

* 名前：加納 寛之（かのう ひろゆき）
* どんな人？
  * 市内のIT系の会社でシステムエンジニアをしています。
  * 元々、学校の先生をしていました。
  * 学校で働いていた当時は数学を教えていましたが、専門は情報です。

= 経歴と技術スタック

* 2014~18年　島根大学総合理工学部 数理・情報システム学科　入学/卒業
* 2018~20年　同学科大学院　入学/修了
    * 査読付き国際学術論文誌 「Efficiency improvement techniques for private intersection-sum protocol using Bloom filter」
    * https://link.springer.com/article/10.1007/s42452-021-04910-z
* 2020~23年　市内高等学校勤務 数学・情報
* 2023年~　　市内ITシステム系会社勤務　システムエンジニア

= 技術スタック

* 言語：Ruby, Javascript, jQuery, React, Typescript, HTML/CSS
* フレームワーク：Ruby on Rails, Spec
* データベース: PostgrSQL, MySQL, SQLite
* その他：暗号数理応用, Gitとかとか
* 最近はもっぱらAIを活用したサービスを作ってます
* AIチャットBotとかはもちろん、RAG構成など。。。。

= 趣味

* オフショアフィッシング（=船で釣りに行くこと）
* 週末は天気良ければ遊漁船をしてます。
* あとはDIYが好きで、最近は庭のウッドデッキをつくりました。
* 日々、AIにプログラミングをさせる

= 授業の進め方

* 連絡は基本クラスルームに記載の専用ホームページで行います。
    * 情報の授業はじめには各自で開いておくこと。
    * ブックマークしておいてね
* 出席もそこで行います
    * 授業中だけサーバを立てておくので各自で出席入力すること
    * 画面にリアルタイムで受信状況だしとくから確認
* 授業の資料もここにおきます。
* 授業後の小テストもここにおきます。

= 最後に

* 昔は先生として教壇に立っていましたが、今は先生ではあるけれど1人のエンジニアとしてみんなの前に立ちたいなと思っています。
* 本気でプログラマを目指す子はもちろん、将来情報関係の仕事に興味のある人は遠慮なく質問してください。
* 1年間よろしくお願いします。( ´ ▽ ` )
